#************************Home_Work_2_Go_it*************************

#*********** Керуючі конструкції. Винятки/Control structures. Exceptions **************

 
# =======================  Завдання 1/Task_1  ==================

#++++++++++++++++++++++++ Умова/Condition   +++++++++++++++++++++++

# На технічній співбесіді претенденти на посаду одержують оцінку за тест. 
# У наступний тур співбесіди проходять кандидати, які склали тест на 83 бали включно або вище. 
# Реалізуйте оператор контролю виконання так, щоб він привласнив логічній змінній is_next значення True, 
# якщо кількість набраних балів буде більшою або дорівнює 83. В іншому випадку значення змінної дорівнює False.

# ++++++++++++++++++++++++   Код/Code   +++++++++++++++++++++++++++++++++++

# is_next = None # Оголошуємо зміну *is_next через присвоєння значення *None ( невідомий тип даних)

# num = int(input("Enter the number of points: ")) # просимо вести з клавіатури кількість балів які отримали за тест. Приводимо введені дані до числових .Позаовчуванню input повертає введені дані типу *str(стрічка/рядок)

# if num >= 83 : # переврка чи кількість балів відповідає умові. якщо більше рівне 83 виконуємо тіло умови. # Якщо умова if виконнується (True) тоді виконуться тіло (код розміщений на 4 пробіли/tab вправо від положення if )
#     is_next = True # тіло умови if .  *is_next присвоюємо значення  *True

# else : # якщо умова if невикнується переходимо до *else і виконуємо тіло  *else (код розміщений на 4 пробіли/tab вправо від положення *else )
    
#     is_next = False # тіло умови *else.  *is_next присвоюємо значення  *False


# =======================  Завдання 2/Task_2  ==================

#++++++++++++++++++++++++ Умова/Condition   +++++++++++++++++++++++

# У нас є три логічні змінні.

# Перша визначає статус користувача is_active, яка дорівнює True або False.
# Друга is_admin визначає, чи є у користувача права адміністратора теж булевого типу.
# Третя is_permission — чи дозволено доступ, теж булевого типу.
# Приведіть змінні is_active, is_admin та is_permission до булевого вигляду.

# Надайте змінній access значення, яке покаже, чи є доступ у користувача. Використовуйте логічні оператори.

# Адміністратор завжди має доступ, незалежно від значень змінних is_permission та is_active.

# Користувач має доступ, тільки якщо is_permission дорівнює True та is_active також дорівнює True.

# ++++++++++++++++++++++++   Код/Code   +++++++++++++++++++++++++++++++++++

is_active = input("Is the user active? y/n ? ") # Просимо вести користувача y чи n і присвоюємо відповідне значення зміній *is_active
is_admin = input("Is the user administrator? y/n? ") # Просимо вести користувача y чи n і присвоюємо відповідне значення зміній *is_admin
is_permission = input("Does the user have access? y/n?") # Просимо вести користувача y чи n і присвоюємо відповідне значення зміній *is_permission

if is_active == "y" :  # Перевірка чи ввели "y" на першому питані ( is_active == "y" )
    is_active = True   # якщо умова виконується *is_active переприсвоюємо значення *True
else:                  # якщо умова не виконується ,  увсіх інших випадках крім  , *is_active == "y"
    is_active = False  # *is_active переприсвоюємо значення *False

if is_admin == "y" :   # Перевірка чи ввели "y" на другому   питані ( is_admin == "y" )
    is_admin = True    # якщо умова виконується *is_admin переприсвоюємо значення *True
else:                  # якщо умова не виконується , увсіх інших випадках крім , *is_admin == "y"
    is_admin = False   # *is_admin переприсвоюємо значення *False

if is_permission == "y" : # Перевірка чи ввели "y" на третьому питані ( is_permission == "y" )
    is_permission = True  # якщо умова виконується *is_permission переприсвоюємо значення *True
else:                     # якщо умова не виконується , увсіх інших випадках , крім *is_permission == "y"
    is_permission = False # *is_permission переприсвоюємо значення *False

access = is_admin or is_active and is_permission # присвоюємо зміній *access значення виконання булевих перації "or"(або) і "and"(і) .Присвоїть *True  якщо хочаб умови is_admin і is_permission  будуть *True в інакшому випадку буде *False


if access and is_admin :                # перевіряємо чи access *True і *is_admin *True
    print ("У вас є доступ адміна " )   # якщо умова виконалась виводимо - У вас є доступ адміна 
elif  is_active  and is_permission  :   # *elif(або) перевірмо чи *is_active == *True і *is_permission == *True
     
    print("У вас доспуп  корситувача ") # якщо умова *elif(або) виконується виводимо -  У вас доспуп  корситувача 

else:                                   # у всіх інших випадках 
    print(f"У доступу відмовлено ")     # виводимо - У доступу відмовлено